Y-m-Zhang/NRF52832/ADS1292 SPI/ikm/lis3dh_drive.c
/* Copyright (c) [2014 Baidu]. All Rights Reserved.
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * File Name          : 
 * Author             : 
 * Version            : $Revision:$
 * Date               : $Date:$
 * Description        : 
 *                      
 * HISTORY:
 * Date               | Modification                    | Author
 * 28/03/2014         | Initial Revision                | 
 
 */

/* Includes ------------------------------------------------------------------*/
//#include <math.h>
//#include <stdio.h>
#include "lis3dh_driver.h"
#include "app_error.h"
#include "nrf_drv_spi.h"
#include "app_util_platform.h"
#include "nrf_delay.h"
#include "app_uart.h"


#define SPI_CS_PIN   25  /* nRF52832只能使用GPIO作为片选，所以这个单独定义了SPI CS管脚.*/
#define SPI_BUFSIZE 8

#define SPI_INSTANCE  0 /**< SPI instance index. */

#define FIFO_STREAM_MODE
#define LIS3DH_ODR_FREQ LIS3DH_ODR_100Hz

//extern  bool LIS3DH_ReadReg(u8_t Reg, u8_t* Data);
//extern  u8_t LIS3DH_WriteReg(u8_t WriteAddr, u8_t Data);
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

uint8_t   SPI_Tx_Buf[SPI_BUFSIZE];
uint8_t   SPI_Rx_Buf[SPI_BUFSIZE];
volatile  uint8_t   SPIReadLength, SPIWriteLength;
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
}
/*******************************************************************************
* Function Name  : LIS3DH_ReadReg
* Description  : Generic Reading function. It must be fullfilled with either
*   : I2C or SPI reading functions     
* Input   : Register Address
* Output  : Data REad
* Return  : None
*******************************************************************************/
bool LIS3DH_ReadReg(uint8_t Reg, uint8_t* Data)
{
    spi_xfer_done = false;
    /* Write transaction */
    SPI_Tx_Buf[0] = Reg | LIS3DH_READBIT;

    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, SPI_Tx_Buf, 2, SPI_Rx_Buf, 2));
	  while(spi_xfer_done == false);
    /* Send received value back to the caller */
    *Data = SPI_Rx_Buf[1];

    return true;
}

/*******************************************************************************
* Function Name  : LIS3DH_WriteReg
* Description  : Generic Writing function. It must be fullfilled with either
*   : I2C or SPI writing function
* Input   : Register Address, Data to be written
* Output  : None
* Return  : None
*******************************************************************************/
u8_t LIS3DH_WriteReg(uint8_t WriteAddr, uint8_t Data)
{
    spi_xfer_done = false;
    SPIWriteLength = 2;
    SPIReadLength = 0;
    SPI_Tx_Buf[0] = WriteAddr;
    SPI_Tx_Buf[1] = (Data);
    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, SPI_Tx_Buf, SPIWriteLength, SPI_Rx_Buf, SPIReadLength));
	  while(spi_xfer_done == false);
    return true;
}
/**********************************************************************************************
 * 描  述 : 初始化LIS3DH
 * 入  参 : 无
 * 返回值 : 无
 *********************************************************************************************/ 
uint8_t LIS3DH_Init(void)
{
    uint8_t whoami;

    /* 初始化SPI */
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG(SPI_INSTANCE);
    spi_config.ss_pin = SPI_CS_PIN; //nRF51822只能使用GPIO作为片选，所以这个单独定义了SPI CS管脚
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
    nrf_delay_ms(500);
	
    /*读取WHO_AM_I判断LIS3DH是否存在 */
	  LIS3DH_ReadReg(LIS3DH_WHO_AM_I,&whoami);
	  printf(" %02X",(uint8_t)whoami);

	  if(whoami != 0x33)
	  {
        while(1)
				{
					  printf("LIS3DH is not found!\r\n");
			      nrf_delay_ms(1000);
				}	  
	  }
	
		//设置ODR：100Hz
		if(LIS3DH_SetODR(LIS3DH_ODR_100Hz) == MEMS_SUCCESS)printf("SET_ODR_OK\r\n");
		//设置工作模式：NORMAL
		if(LIS3DH_SetMode(LIS3DH_NORMAL) == MEMS_SUCCESS)printf("SET_MODE_OK\r\n");
    //设置分辨率：+/-2G
		if(LIS3DH_SetFullScale(LIS3DH_FULLSCALE_2) == MEMS_SUCCESS)printf("SET_FULLSCALE_OK\r\n");
    
		if(LIS3DH_SetAxis(LIS3DH_X_ENABLE | LIS3DH_Y_ENABLE | LIS3DH_Z_ENABLE) == MEMS_SUCCESS)printf("SET_AXIS_OK\r\n");

#ifdef FIFO_STREAM_MODE
    //LIS3DH_FIFOModeEnable(LIS3DH_FIFO_STREAM_MODE);
#else
    //LIS3DH_FIFOModeEnable(LIS3DH_FIFO_MODE);
#endif

    return true;
}
/*******************************************************************************
* Function Name  : LIS3DH_GetStatusAUX
* Description    : Read the AUX status register
* Input          : Char to empty by status register buffer
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LIS3DH_GetStatusAUX(u8_t* val)
{

    if( !LIS3DH_ReadReg(LIS3DH_STATUS_AUX, val) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3DH_GetStatusAUXBIT
* Description    : Read the AUX status register BIT
* Input          : LIS3DH_STATUS_AUX_321OR, LIS3DH_STATUS_AUX_3OR, LIS3DH_STATUS_AUX_2OR, LIS3DH_STATUS_AUX_1OR,
                   LIS3DH_STATUS_AUX_321DA, LIS3DH_STATUS_AUX_3DA, LIS3DH_STATUS_AUX_2DA, LIS3DH_STATUS_AUX_1DA
* Output         : None
* Return         : Status of BIT [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LIS3DH_GetStatusAUXBit(u8_t statusBIT, u8_t* val)
{
    u8_t value;

