Y-m-Zhang/NRF52832/ADS1292 SPI/ikm/lis3dh_drive.c
/*******************************************************************************
* Function Name  : LIS3DH_GetFifoSourceReg
* Description    : Read Fifo source Register
* Input          : Byte to empty by FIFO source register value
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LIS3DH_GetFifoSourceReg(u8_t* val)
{

    if( !LIS3DH_ReadReg(LIS3DH_FIFO_SRC_REG, val) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}


/*******************************************************************************
* Function Name  : LIS3DH_GetFifoSourceBit
* Description    : Read Fifo WaterMark source bit
* Input          : statusBIT: LIS3DH_FIFO_SRC_WTM, LIS3DH_FIFO_SRC_OVRUN, LIS3DH_FIFO_SRC_EMPTY
*       val: Byte to fill  with the bit value
* Output         : None
* Return         : Status of BIT [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LIS3DH_GetFifoSourceBit(u8_t statusBIT,  u8_t* val)
{
    u8_t value;

    if( !LIS3DH_ReadReg(LIS3DH_FIFO_SRC_REG, &value) )
        return MEMS_ERROR;


    if(statusBIT == LIS3DH_FIFO_SRC_WTM) {
        if(value &= LIS3DH_FIFO_SRC_WTM) {
            *val = MEMS_SET;
            return MEMS_SUCCESS;
        } else {
            *val = MEMS_RESET;
            return MEMS_SUCCESS;
        }
    }

    if(statusBIT == LIS3DH_FIFO_SRC_OVRUN) {
        if(value &= LIS3DH_FIFO_SRC_OVRUN) {
            *val = MEMS_SET;
            return MEMS_SUCCESS;
        } else {
            *val = MEMS_RESET;
            return MEMS_SUCCESS;
        }
    }
    if(statusBIT == LIS3DH_FIFO_SRC_EMPTY) {
        if(value &= statusBIT == LIS3DH_FIFO_SRC_EMPTY) {
            *val = MEMS_SET;
            return MEMS_SUCCESS;
        } else {
            *val = MEMS_RESET;
            return MEMS_SUCCESS;
        }
    }
    return MEMS_ERROR;
}


/*******************************************************************************
* Function Name  : LIS3DH_GetFifoSourceFSS
* Description    : Read current number of unread samples stored in FIFO
* Input          : Byte to empty by FIFO unread sample value
* Output         : None
* Return         : Status [value of FSS]
*******************************************************************************/
status_t LIS3DH_GetFifoSourceFSS(u8_t* val)
{
    u8_t value;

    if( !LIS3DH_ReadReg(LIS3DH_FIFO_SRC_REG, &value) )
        return MEMS_ERROR;

    value &= 0x1F;

    *val = value;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3DH_SetSPIInterface
* Description    : Set SPI mode: 3 Wire Interface OR 4 Wire Interface
* Input          : LIS3DH_SPI_3_WIRE, LIS3DH_SPI_4_WIRE
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LIS3DH_SetSPIInterface(LIS3DH_SPIMode_t spi)
{
    u8_t value;

    if( !LIS3DH_ReadReg(LIS3DH_CTRL_REG4, &value) )
        return MEMS_ERROR;

    value &= 0xFE;
    value |= spi<<LIS3DH_SIM;

    if( !LIS3DH_WriteReg(LIS3DH_CTRL_REG4, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}
bool LIS3DH_enableFiFo(void)
{
    ASSERT(LIS3DH_SetTemperature(MEMS_ENABLE));

    /* Set data rate and power mode, and enable X/Y/Z */
    ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG1,
                           LIS3DH_CTRL_REG1_DATARATE_50HZ|    /* Normal mode, 10Hz */
                           LIS3DH_CTRL_REG1_XYZEN));           /* Enable X, Y and Z */
    // Settings for CTRL_REG2:
    // defaults
    ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG2, 0));
    // Settings for CTRL_REG3
    ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG3, 0));

    // Settings for CTRL_REG4:
    //   ----------------------------------------------------------------------------------------
    //CTRL_REG4| 7    6     5      4   3    2     1      0  |
    //   | BDU    BLE     FS1     FS2    HR    ST1   ST0   SIM|
    //    ----------------------------------------------------------------------------------------
    // FS1:FS2 -->g'range selection 00-->2g;01-->4g;10-->8g;11-->16g:
    // HR = 1  --> high resolution
    // SIM  -->if ==1 serial interface mode is selected(SPI)

    /* Settings for CTRL_REG4 Enable block update and set range to +/-2G */
    ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG4, 0x08));


    //  ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG5, 0x80));
    /* LIS3DH_CTRL_REG4_BLOCKDATAUPDATE   Enable block update */
    //  LIS3DH_CTRL_REG4_SCALE_2G));        /* +/-2G measurement range */
#ifdef TESTFIFO
    // Settings for CTRL_REG5:
    //   ----------------------------------------------------------------------------------------
    //CTRL_REG5| 7    6     5      4   3    2    1      0  |
    //    | BOOT   FIFO_EN     --   --      LIR_INT1    D4D_INT1      0   0  |
    //    ----------------------------------------------------------------------------------------
    ASSERT(LIS3DH_WriteReg( LIS3DH_CTRL_REG5 ,
                            BIT_6 |   /*Enable FIFO*/
                            BIT_3  /*lATCH INTERRUPT request on INT1_SRC register, with INT1_SRC register cleared by reading INT1_SRC itself*/

                          ));

    //---TESTING CLICK WITH CTRL_REG_6:
    // Settings for CTRL_REG6:
    //     ---------------------------------------------------------------------------------------------
    //CTRL_REG6| 7    | 6   | 5      | 4     | 3    | 2   | 1     | 0  |
    //    | I2_CLICKen  | I2_INT1   | 0   | BOOT_I1 | 0       |      | H_L-ACTIVE  |   -- |
    //   ---------------------------------------------------------------------------------------------

    ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG6 ,
                           BIT_7 | BIT_6)); /* enable tap and double tap interruppts on INT2 pin*/

    //   ----------------------------------------------------------------------------------------
    //CLICK_CFG| 7    6     5      4   3    2     1      0  |
    //   | --    --   ZD(DOUB) ZS(SING) YD     YS   XD     XS |
    //    ----------------------------------------------------------------------------------------
    ASSERT(LIS3DH_WriteReg( LIS3DH_CLICK_CFG ,
                            BIT_5));//Enable interrupt double CLICK-CLICK on Z axis  enable interrupt request on measured accel. value higher than preset threshold

    //CLICK_THS
    //Threshold for click detection (arbitary value) 1LSb = fullscale/128

    ASSERT(LIS3DH_WriteReg( LIS3DH_CLICK_THS , 0x03 ));

