Y-m-Zhang/NRF52832/ADS1292 SPI/ikm/lis3dh_drive.c
    //TIME_LIMIT
    //Time limit a short time frame where in which click is recognised when
    //1.corresponding value in that axis exceeds threshold and
    // 2.comes below threshold.
    // To get detected both should happen in this time limit.
    ASSERT(LIS3DH_WriteReg( LIS3DH_TIME_LIMIT , 0x33 ));

    ASSERT(LIS3DH_WriteReg( LIS3DH_TIME_LATENCY , 0xFF ));



    /* Enable FIFO */
    ASSERT(LIS3DH_WriteReg(LIS3DH_FIFO_CTRL_REG,
                           BIT_6 /* FIFO MODE, trigger signal on INT1 */
                          ));

    /* Enable interrupt */
    ASSERT(LIS3DH_WriteReg(LIS3DH_INT1_CFG,
                           BIT_6 /* FIFO MODE, trigger signal on INT1 */
                          ));
#endif
    // Settings for INT1_CFG
    // defaults

    // Settings for INT1_THS
    // defaults

    // Settings for INT1_DUR
    // Defaults

    return true;
}
/**************************************************************************/
/*!
    @brief  Initialises the SPI block
    1+196 bytes
  197*8 = 1576bits
  1576 /(8*1024*1024)=0.188ms
 
*/
/**************************************************************************/
#define TESTFIFO 1
#if 0
bool LIS3DH_test()
{
    uint8_t index;
    uint8_t values[256];
    uint32_t pg_size;
    //ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG2,0));
    while(1) {
        //ASSERT(LIS3DH_WriteReg(LIS3DH_CTRL_REG2,ii));
        for(index = 0;index <20; index ++) {
            ASSERT(LIS3DH_ReadReg(LIS3DH_CTRL_REG1+index,values+index));
            //simple_uart_put(values[index]);
        }
        for(pg_size = 0xfffff; pg_size > 0; pg_size --)
            ;
        /*
         for(index = 0;index <6; index ++)
          {
            ASSERT(LIS3DH_ReadReg(LIS3DH_OUT_X_L+index,acc+index));  
            for(pg_size = 0xffff; pg_size > 0; pg_size --);   
          }
          simple_uart_put(0x55);
          simple_uart_put(acc[1]);
          simple_uart_put(acc[3]);
          simple_uart_put(acc[5]);
           */

    }
    return true;

}
#endif
/******************* (C) COPYRIGHT 2013 Bidu *****END OF FILE****/
